import React from 'react';
import {BsArrowRight} from "react-icons/bs";

const AllCourses = () => {
    return (
        <div className='AllCourses'>
            <div className="container">
                <h6>Главная / Наши курсы</h6>
                <div className="courses">
                    <h5>Курсы</h5>
                    <div className="courses--blocks">
                        <div className="courses--blocks--block">
                            <h1>Frontend-разработчик</h1>
                            <p>Мастер создания сайтов. Умеет делать их красивыми, интерактивными, с большим функционалом. Профессия отлично подойдет тем, кто хочет фрилансить и постоянно разрабатывать новые проекты</p>
                            <h3>Подробнее <BsArrowRight/></h3>
                        </div>
                        <div className="courses--blocks--block">
                            <h1>Frontend-разработчик</h1>
                            <p>Мастер создания сайтов. Умеет делать их красивыми, интерактивными, с большим функционалом. Профессия отлично подойдет тем, кто хочет фрилансить и постоянно разрабатывать новые проекты</p>
                            <h3>Подробнее <BsArrowRight/></h3>
                        </div>
                        <div className="courses--blocks--block">
                            <h1>Frontend-разработчик</h1>
                            <p>Мастер создания сайтов. Умеет делать их красивыми, интерактивными, с большим функционалом. Профессия отлично подойдет тем, кто хочет фрилансить и постоянно разрабатывать новые проекты</p>
                            <h3>Подробнее <BsArrowRight/></h3>
                        </div>
                        <div className="courses--blocks--block">
                            <h1>Frontend-разработчик</h1>
                            <p>Мастер создания сайтов. Умеет делать их красивыми, интерактивными, с большим функционалом. Профессия отлично подойдет тем, кто хочет фрилансить и постоянно разрабатывать новые проекты</p>
                            <h3>Подробнее <BsArrowRight/></h3>
                        </div>
                        <div className="courses--blocks--block">
                            <h1>Frontend-разработчик</h1>
                            <p>Мастер создания сайтов. Умеет делать их красивыми, интерактивными, с большим функционалом. Профессия отлично подойдет тем, кто хочет фрилансить и постоянно разрабатывать новые проекты</p>
                            <h3>Подробнее <BsArrowRight/></h3>
                        </div>
                        <div className="courses--blocks--block">
                            <h1>Frontend-разработчик</h1>
                            <p>Мастер создания сайтов. Умеет делать их красивыми, интерактивными, с большим функционалом. Профессия отлично подойдет тем, кто хочет фрилансить и постоянно разрабатывать новые проекты</p>
                            <h3>Подробнее <BsArrowRight/></h3>
                        </div>
                        <div className="courses--blocks--block">
                            <h1>Frontend-разработчик</h1>
                            <p>Мастер создания сайтов. Умеет делать их красивыми, интерактивными, с большим функционалом. Профессия отлично подойдет тем, кто хочет фрилансить и постоянно разрабатывать новые проекты</p>
                            <h3>Подробнее <BsArrowRight/></h3>
                        </div>
                        <div className="courses--blocks--block">
                            <h1>Frontend-разработчик</h1>
                            <p>Мастер создания сайтов. Умеет делать их красивыми, интерактивными, с большим функционалом. Профессия отлично подойдет тем, кто хочет фрилансить и постоянно разрабатывать новые проекты</p>
                            <h3>Подробнее <BsArrowRight/></h3>
                        </div>
                        <div className="courses--blocks--block">
                            <h1>Frontend-разработчик</h1>
                            <p>Мастер создания сайтов. Умеет делать их красивыми, интерактивными, с большим функционалом. Профессия отлично подойдет тем, кто хочет фрилансить и постоянно разрабатывать новые проекты</p>
                            <h3>Подробнее <BsArrowRight/></h3>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    );
};

export default AllCourses;